apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_flash_v1v2.h
#    elif defined(CONFIG_STM32_FLASH_CONFIG_G)
#      define STM32_FLASH_NPAGES      12
#      define STM32_FLASH_SIZE        _K((4 * 16) + (1 * 64) + (7 * 128))
#      define STM32_FLASH_SIZES       {_K(16), _K(16), _K(16), _K(16),    \
                                      _K(64), _K(128), _K(128), _K(128),  \
                                      _K(128), _K(128), _K(128), _K(128)}

#    elif defined(CONFIG_STM32_FLASH_CONFIG_I) && defined(CONFIG_STM32_STM32F4XXX)
#      define STM32_FLASH_NPAGES      24
#      define STM32_FLASH_SIZE        _K((4 * 16) + (1 * 64) + (7 * 128)) + \
                                      _K((4 * 16) + (1 * 64) + (7 * 128))
#      define STM32_FLASH_SIZES       {_K(16), _K(16), _K(16), _K(16),      \
                                      _K(64), _K(128), _K(128), _K(128),    \
                                      _K(128), _K(128), _K(128), _K(128),   \
                                      _K(16), _K(16), _K(16), _K(16),       \
                                      _K(64), _K(128), _K(128), _K(128),    \
                                      _K(128), _K(128), _K(128), _K(128)}
#    endif

/* Define the Valid Configuration the G4 */

#  elif defined(CONFIG_STM32_STM32G4XXX)
#    if defined(CONFIG_STM32_STM32G43XX)
#      if defined(CONFIG_STM32_FLASH_CONFIG_6)
#        define STM32_FLASH_NPAGES      16
#        define STM32_FLASH_PAGESIZE    2048

#      elif defined(CONFIG_STM32_FLASH_CONFIG_8)
#        define STM32_FLASH_NPAGES      32
#        define STM32_FLASH_PAGESIZE    2048

#      elif defined(CONFIG_STM32_FLASH_CONFIG_B)
#        define STM32_FLASH_NPAGES      64
#        define STM32_FLASH_PAGESIZE    2048
#      endif
#    elif defined(CONFIG_STM32_STM32G47XX) || defined(CONFIG_STM32_STM32G48XX)
#      if defined(CONFIG_STM32_FLASH_CONFIG_B)
#        define STM32_FLASH_SIZE        32 * 4096

#      elif defined(CONFIG_STM32_FLASH_CONFIG_C)
#        define STM32_FLASH_SIZE        64 * 4096

#      elif defined(CONFIG_STM32_FLASH_CONFIG_E)
#        define STM32_FLASH_SIZE        128 * 4096
#      endif
#    elif defined(CONFIG_STM32_STM32G49XX)
#      elif defined(CONFIG_STM32_FLASH_CONFIG_C)
#        define STM32_FLASH_NPAGES      128
#        define STM32_FLASH_PAGESIZE    2048

#      elif defined(CONFIG_STM32_FLASH_CONFIG_E)
#        define STM32_FLASH_NPAGES      256
#        define STM32_FLASH_PAGESIZE    2048
#    endif

/* Define the Valid Configuration the F1 and F3  */

#  else
#    if defined(CONFIG_STM32_FLASH_CONFIG_4)
#      define STM32_FLASH_NPAGES      16
#      define STM32_FLASH_PAGESIZE    1024
#    elif defined(CONFIG_STM32_FLASH_CONFIG_6)
#      define STM32_FLASH_NPAGES      32
#      define STM32_FLASH_PAGESIZE    1024
#    elif defined(CONFIG_STM32_FLASH_CONFIG_8)
#      define STM32_FLASH_NPAGES      64
#      define STM32_FLASH_PAGESIZE    1024
#    elif defined(CONFIG_STM32_FLASH_CONFIG_B)
#      define STM32_FLASH_NPAGES      128
#      define STM32_FLASH_PAGESIZE    1024
#    elif defined(CONFIG_STM32_FLASH_CONFIG_C)
#      define STM32_FLASH_NPAGES      128
#      define STM32_FLASH_PAGESIZE    2048
#    elif defined(CONFIG_STM32_FLASH_CONFIG_D)
#      define STM32_FLASH_NPAGES      192
#      define STM32_FLASH_PAGESIZE    2048
#    elif defined(CONFIG_STM32_FLASH_CONFIG_E)
#      define STM32_FLASH_NPAGES      256
#      define STM32_FLASH_PAGESIZE    2048
#    elif defined(CONFIG_STM32_FLASH_CONFIG_F)
#      define STM32_FLASH_NPAGES      384
#      define STM32_FLASH_PAGESIZE    2048
#    elif defined(CONFIG_STM32_FLASH_CONFIG_G)
#      define STM32_FLASH_NPAGES      512
#      define STM32_FLASH_PAGESIZE    2048
#    elif defined(CONFIG_STM32_FLASH_CONFIG_I)
#    endif
#  endif
#endif /* !defined(CONFIG_STM32_FLASH_CONFIG_DEFAULT) */

#ifdef STM32_FLASH_PAGESIZE
#  define STM32_FLASH_SIZE            (STM32_FLASH_NPAGES * STM32_FLASH_PAGESIZE)
#endif

/* STM32F101 and STM32F103 with flash size > 512kB are dual-bank devices.
 * where bank 0 contains pages 0..255 and bank 1 contains the rest.
 */

#if defined(CONFIG_STM32_STM32F10XX) && (STM32_FLASH_NPAGES > 256)
#  define STM32_FLASH_DUAL_BANK      1
#  define STM32_FLASH_BANK0_NPAGES   256
#  define STM32_FLASH_BANK1_NPAGES   (STM32_FLASH_NPAGES - STM32_FLASH_BANK0_NPAGES)
#  define STM32_FLASH_BANK0_BASE     (STM32_FLASH_BASE)
#  define STM32_FLASH_BANK1_BASE     \
      (STM32_FLASH_BASE + STM32_FLASH_PAGESIZE * STM32_FLASH_BANK0_NPAGES)
#endif

/* Register Offsets *********************************************************/

#define STM32_FLASH_ACR_OFFSET       0x0000
#if defined(CONFIG_STM32_STM32L15XX)
#  define STM32_FLASH_PECR_OFFSET    0x0004
#  define STM32_FLASH_PDKEYR_OFFSET  0x0008
#  define STM32_FLASH_PEKEYR_OFFSET  0x000c
#  define STM32_FLASH_PRGKEYR_OFFSET 0x0010
#  define STM32_FLASH_OPTKEYR_OFFSET 0x0014
#  define STM32_FLASH_SR_OFFSET      0x0018
#  define STM32_FLASH_OBR_OFFSET     0x001c
#  define STM32_FLASH_WRPR1_OFFSET   0x0020
#  define STM32_FLASH_WRPR2_OFFSET   0x0080
#  define STM32_FLASH_WRPR3_OFFSET   0x0084
#  define STM32_FLASH_WRPR4_OFFSET   0x0088
#elif defined(CONFIG_STM32_STM32G4XXX)
#  define STM32_FLASH_PDKEYR_OFFSET    0x0004
#  define STM32_FLASH_KEYR_OFFSET      0x0008
#  define STM32_FLASH_OPTKEYR_OFFSET   0x000c
#  define STM32_FLASH_SR_OFFSET        0x0010
#  define STM32_FLASH_CR_OFFSET        0x0014
#  define STM32_FLASH_ECCR_OFFSET      0x0018
#  define STM32_FLASH_OPTR_OFFSET      0x0020
#  define STM32_FLASH_PCROP1SR_OFFSET  0x0024
#  define STM32_FLASH_PCROP1ER_OFFSET  0x0028
#  define STM32_FLASH_WRP1AR_OFFSET    0x002c
#  define STM32_FLASH_WRP1BR_OFFSET    0x0030
#  define STM32_FLASH_PCROP2SR_OFFSET  0x0044
#  define STM32_FLASH_PCROP2ER_OFFSET  0x0048
#  define STM32_FLASH_WRP2AR_OFFSET    0x004c
#  define STM32_FLASH_WRP2BR_OFFSET    0x0050
#  define STM32_FLASH_SEC1R_OFFSET     0x0070
#  define STM32_FLASH_SEC2R_OFFSET     0x0074
#else
#  define STM32_FLASH_KEYR_OFFSET    0x0004
#  define STM32_FLASH_OPTKEYR_OFFSET 0x0008
#  define STM32_FLASH_SR_OFFSET      0x000c
#  define STM32_FLASH_CR_OFFSET      0x0010
#  if defined(CONFIG_STM32_STM32F10XX) || defined(CONFIG_STM32_STM32F30XX) || \
      defined(CONFIG_STM32_STM32F33XX) || defined(CONFIG_STM32_STM32F37XX)
#    define STM32_FLASH_AR_OFFSET    0x0014
#    define STM32_FLASH_OBR_OFFSET   0x001c
#    define STM32_FLASH_WRPR_OFFSET  0x0020
#  elif defined(CONFIG_STM32_HAVE_IP_FLASH_M3M4_F2F4)
#    define STM32_FLASH_OPTCR_OFFSET 0x0014
#  endif
#endif

#if defined(CONFIG_STM32_STM32F427) || defined(CONFIG_STM32_STM32F429) || \
    defined(CONFIG_STM32_STM32F469)
#  define STM32_FLASH_OPTCR1_OFFSET  0x0018
#endif

#if defined(CONFIG_STM32_STM32F10XX) && defined(STM32_FLASH_DUAL_BANK)
#  define STM32_FLASH_BANK0_REGS_OFFSET 0
#  define STM32_FLASH_BANK1_REGS_OFFSET 0x40

#  define STM32_FLASH_KEYR1_OFFSET   0x0044
#  define STM32_FLASH_SR1_OFFSET     0x004c
#  define STM32_FLASH_CR1_OFFSET     0x0050
#  define STM32_FLASH_AR2_OFFSET     0x0054
#endif

