apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_flash_v1v2.h
/* Flash Control Register (CR) */

#if defined(CONFIG_STM32_STM32F10XX) || defined(CONFIG_STM32_STM32F30XX) || \
    defined(CONFIG_STM32_STM32F33XX) || defined(CONFIG_STM32_STM32F37XX)
#  define FLASH_CR_PG               (1 << 0)  /* Bit 0: Program Page */
#  define FLASH_CR_PER              (1 << 1)  /* Bit 1: Page Erase */
#  define FLASH_CR_MER              (1 << 2)  /* Bit 2: Mass Erase */
#  define FLASH_CR_OPTPG            (1 << 4)  /* Bit 4: Option Byte Programming */
#  define FLASH_CR_OPTER            (1 << 5)  /* Bit 5: Option Byte Erase */
#  define FLASH_CR_STRT             (1 << 6)  /* Bit 6: Start Erase */
#  define FLASH_CR_LOCK             (1 << 7)  /* Bit 7: Page Locked or Lock Page */
#  define FLASH_CR_OPTWRE           (1 << 9)  /* Bit 8: Option Bytes Write Enable */
#  define FLASH_CR_ERRIE            (1 << 10) /* Bit 10: Error Interrupt Enable */
#  define FLASH_CR_EOPIE            (1 << 12) /* Bit 12: End of Program Interrupt Enable */
#  if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F33XX) || \
      defined(CONFIG_STM32_STM32F37XX)
#    define FLASH_CR_OBL_LAUNCH     (1 << 13) /* Bit 13: Force option byte loading */
#  endif
#elif defined(CONFIG_STM32_HAVE_IP_FLASH_M3M4_F2F4)
#  define FLASH_CR_PG               (1 << 0)               /* Bit 0: Programming */
#  define FLASH_CR_SER              (1 << 1)               /* Bit 1: Sector Erase */
#  define FLASH_CR_MER              (1 << 2)               /* Bit 2: Mass Erase sectors 0..11 */
#  define FLASH_CR_SNB_SHIFT        (3)                    /* Bits 3-6: Sector number */
#  if defined(CONFIG_STM32_STM32F427) || defined(CONFIG_STM32_STM32F429)
#    define FLASH_CR_SNB_MASK       (31 << FLASH_CR_SNB_SHIFT)
#    define FLASH_CR_SNB(n)         (((n % 12) << FLASH_CR_SNB_SHIFT) | ((n / 12) << 7)) /* Sector n, n=0..23 */
#  else
#    define FLASH_CR_SNB_MASK       (15 << FLASH_CR_SNB_SHIFT)
#    define FLASH_CR_SNB(n)         ((n) << FLASH_CR_SNB_SHIFT) /* Sector n, n=0..11 */
#  endif
#  define FLASH_CR_PSIZE_SHIFT      (8)                    /* Bits 8-9: Program size */
#  define FLASH_CR_PSIZE_MASK       (3 << FLASH_CR_PSIZE_SHIFT)
#    define FLASH_CR_PSIZE_X8       (0 << FLASH_CR_PSIZE_SHIFT) /* 00 program x8 */
#    define FLASH_CR_PSIZE_X16      (1 << FLASH_CR_PSIZE_SHIFT) /* 01 program x16 */
#    define FLASH_CR_PSIZE_X32      (2 << FLASH_CR_PSIZE_SHIFT) /* 10 program x32 */
#    define FLASH_CR_PSIZE_X64      (3 << FLASH_CR_PSIZE_SHIFT) /* 11 program x64 */
#  define FLASH_CR_STRT             (1 << 16)                   /* Bit 16: Start Erase */
#  define FLASH_CR_EOPIE            (1 << 24)                   /* Bit 24: End of operation interrupt enable */
#  define FLASH_CR_ERRIE            (1 << 25)                   /* Bit 25: Error interrupt enable */
#  define FLASH_CR_LOCK             (1 << 31)                   /* Bit 31: Lock */
#elif defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_CR_PG               (1 << 0)
#  define FLASH_CR_PER              (1 << 1)
#  define FLASH_CR_MER1             (1 << 2)
#  define FLASH_CR_PNB_SHIFT        (3)
#  if defined(CONFIG_STM32_STM32G43XX)
#    define FLASH_CR_PNB_MASK         (0x3f << FLASH_CR_PNB_SHIFT)
#  elif defined(CONFIG_STM32_STM32G47XX) || defined (CONFIG_STM32_STM32G48XX)
#    define FLASH_CR_PNB_MASK         (0x7f << FLASH_CR_PNB_SHIFT)
#  elif defined(CONFIG_STM32_STM32G49XX)
#    define FLASH_CR_PNB_MASK         (0xff << FLASH_CR_PNB_SHIFT)
#  endif
#    define FLASH_CR_PNB(n)         (((n) << FLASH_CR_PNB_SHIFT) & FLASH_CR_PNB_MASK)
#  if defined(CONFIG_STM32_STM32G47XX) || defined (CONFIG_STM32_STM32G48XX)
#    define FLASH_CR_BKER             (1 << 11)
#    define FLASH_CR_MER2             (1 << 15)
#  endif
#  define FLASH_CR_START            (1 << 16)
#  define FLASH_CR_OPTSTRT          (1 << 17)
#  define FLASH_CR_FSTPG            (1 << 18)
#  define FLASH_CR_EOPIE            (1 << 24)
#  define FLASH_CR_ERRIE            (1 << 25)
#  define FLASH_CR_RDERRIE          (1 << 26)
#  define FLASH_CR_OBL_LAUNCH       (1 << 27)
#  define FLASH_CR_SEC_PROT1        (1 << 28)
#  if defined(CONFIG_STM32_STM32G47XX) || defined (CONFIG_STM32_STM32G48XX)
#    define FLASH_CR_SEC_PROT2        (1 << 29)
#  endif
#  define FLASH_CR_OPTLOCK          (1 << 30)
#  define FLASH_CR_LOCK             (1 << 31)
#endif
#if defined(CONFIG_STM32_STM32F427) || defined(CONFIG_STM32_STM32F429)
#  define FLASH_CR_MER1             (1 << 15)              /* Bit 15: Mass Erase sectors 12..23 */
#endif

/* Flash ECC register (ECCR) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_ECCR_ADDR_ECC_SHIFT    (0)
#  define FLASH_ECCR_ADDR_ECC_MASK     (0x7ffff << FLASH_ECCR_ADDR_ECC_SHIFT)
#    define FLASH_ECCR_ADDR_ECC(n)     (((n) << FLASH_ECCR_ADDR_ECC_SHIFT) & FLASH_ECCR_ADDR_ECC_MASK)

#  define FLASH_ECCR_BK_ECC            (1 << 21)
#  define FLASH_ECCR_SYSF_ECC          (1 << 22)
#  define FLASH_ECCR_ECCIE             (1 << 24)
#  if defined(CONFIG_STM32_STM32G47XX) || defined (CONFIG_STM32_STM32G48XX)
#    define FLASH_ECCR_ECCC2             (1 << 28)
#    define FLASH_ECCR_ECCD2             (1 << 29)
#  endif
#  define FLASH_ECCR_ECCC              (1 << 30)
#  define FLASH_ECCR_ECCD              (1 << 31)
#endif

/* Flash Option Control Register (OPTCR) */

#if defined(CONFIG_STM32_HAVE_IP_FLASH_M3M4_F2F4)
#  define FLASH_OPTCR_OPTLOCK       (1 << 0)                        /* Bit 0: Option lock */
#  define FLASH_OPTCR_OPTSTRT       (1 << 1)                        /* Bit 1: Option start */
#  define FLASH_OPTCR_BORLEV_SHIFT  (2)                             /* Bits 2-3: BOR reset Level */
#  define FLASH_OPTCR_BORLEV_MASK   (3 << FLASH_OPTCR_BORLEV_SHIFT)
#    define FLASH_OPTCR_VBOR3       (0 << FLASH_OPTCR_BORLEV_SHIFT) /* 00: BOR Level 3 */
#    define FLASH_OPTCR_VBOR2       (1 << FLASH_OPTCR_BORLEV_SHIFT) /* 01: BOR Level 2 */
#    define FLASH_OPTCR_VBOR1       (2 << FLASH_OPTCR_BORLEV_SHIFT) /* 10: BOR Level 1 */
#    define FLASH_OPTCR_VBOR0       (3 << FLASH_OPTCR_BORLEV_SHIFT) /* 11: BOR off */
#  define FLASH_OPTCR_USER_SHIFT    (5)                             /* Bits 5-7: User option bytes */
#  define FLASH_OPTCR_USER_MASK     (7 << FLASH_OPTCR_USER_SHIFT)
#    define FLASH_OPTCR_NRST_STDBY  (1 << 7)                        /* Bit 7: nRST_STDBY */
#    define FLASH_OPTCR_NRST_STOP   (1 << 6)                        /* Bit 6: nRST_STOP */
#    define FLASH_OPTCR_WDG_SW      (1 << 5)                        /* Bit 5: WDG_SW */
#  define FLASH_OPTCR_RDP_SHIFT     (8)                             /* Bits 8-15: Read protect */
#  define FLASH_OPTCR_RDP_MASK      (0xff << FLASH_OPTCR_RDP_SHIFT)
#  define FLASH_OPTCR_RDP(n)        ((uint32_t)(n) << FLASH_OPTCR_RDP_SHIFT)
#  define FLASH_OPTCR_NWRP_SHIFT    (16)                            /* Bits 16-27: Not write protect */
#  define FLASH_OPTCR_NWRP_MASK     (0xfff << FLASH_OPTCR_NWRP_SHIFT)
#endif

/* Flash Option Control Register (OPTCR1) */

#if defined(CONFIG_STM32_STM32F427) || defined(CONFIG_STM32_STM32F429)
#  define FLASH_OPTCR1_NWRP_SHIFT   (16)                  /* Bits 16-27: Not write protect (high bank) */
#  define FLASH_OPTCR1_NWRP_MASK    (0xfff << FLASH_OPTCR_NWRP_SHIFT)

#  define FLASH_OPTCR1_BFB2_SHIFT   (4)                   /* Bits 4: Dual-bank Boot option byte */
#  define FLASH_OPTCR1_BFB2_MASK    (1 << FLASH_OPTCR_NWRP_SHIFT)
#endif

#if defined(CONFIG_STM32_STM32F446)
#  define FLASH_OPTCR1_NWRP_SHIFT   (16)                  /* Bits 16-23: Not write protect (high bank) */
#  define FLASH_OPTCR1_NWRP_MASK    (0xff << FLASH_OPTCR_NWRP_SHIFT)
#endif

/* Flash option register (OPTR) */

