apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_flash_v1v2.h
#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_OPTR_RDP_SHIFT         (0)
#  define FLASH_OPTR_RDP_MASK          (0xff << FLASH_OPTR_RDP_SHIFT)
#    define FLASH_OPTR_RDP             (((n) << FLASH_OPTR_RDP_SHIFT) & FLASH_OPTR_RDP_MASK)
#  define FLASH_OPTR_BOR_LEV_SHIFT     (8)
#  define FLASH_OPTR_BOR_LEV_MASK      (0x7 << FLASH_OPTR_BOR_LEV_SHIFT)
#    define FLASH_OPTR_BOR_LEV_1_7V    (0x0 << FLASH_OPTR_BOR_LEV_SHIFT)
#    define FLASH_OPTR_BOR_LEV_2_0V    (0x1 << FLASH_OPTR_BOR_LEV_SHIFT)
#    define FLASH_OPTR_BOR_LEV_2_2V    (0x2 << FLASH_OPTR_BOR_LEV_SHIFT)
#    define FLASH_OPTR_BOR_LEV_2_5V    (0x3 << FLASH_OPTR_BOR_LEV_SHIFT)
#    define FLASH_OPTR_BOR_LEV_2_8V    (0x4 << FLASH_OPTR_BOR_LEV_SHIFT)
#  define FLASH_OPTR_NRST_STOP         (1 << 12)
#  define FLASH_OPTR_NRST_STDBY        (1 << 13)
#  define FLASH_OPTR_NRST_SHDW         (1 << 14)
#  define FLASH_OPTR_IWDG_SW           (1 << 16)
#  define FLASH_OPTR_IWDG_STOP         (1 << 17)
#  define FLASH_OPTR_IWDG_STDBY        (1 << 18)
#  define FLASH_OPTR_WWDG_SW           (1 << 19)
#  define FLASH_OPTR_BFB2              (1 << 20)
#  if defined(CONFIG_STM32_STM32G47XX) || defined (CONFIG_STM32_STM32G48XX)
#    define FLASH_OPTR_DBANK           (1 << 22)
#  elif defined (CONFIG_STM32_STM32G49XX)
#    define FLASH_OPTR_PB4_PUPEN       (1 << 22)
#  endif
#  define FLASH_OPTR_NBOOT1            (1 << 23)
#  define FLASH_OPTR_SRAM_PE           (1 << 24)
#  define FLASH_OPTR_CCMSRAM_RST       (1 << 25)
#  define FLASH_OPTR_NSWBOOT0          (1 << 26)
#  define FLASH_OPTR_NBOOT0            (1 << 27)
#  define FLASH_OPTR_NRST_MODE_SHIFT   (28)
#  define FLASH_OPTR_NRST_MODE_MASK    (0x3 << FLASH_OPTR_NRST_MODE_SHIFT)
#    define FLASH_OPTR_NRST_MODE_NRST  (0x1 << FLASH_OPTR_NRST_MODE_SHIFT)
#    define FLASH_OPTR_NRST_MODE_GPIO  (0x2 << FLASH_OPTR_NRST_MODE_SHIFT)
#    define FLASH_OPTR_NRST_MODE_BIDI_NRST (0x3 << FLASH_OPTR_NRST_MODE_SHIFT)
#  define FLASH_OPTR_IRHEN             (1 << 30)
#endif

/* Flash PCROP1 Start Address Register (PCROP1SR) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_PCROP1SR_PCROP1_STRT_SHIFT       (0)
#  define FLASH_PCROP1SR_PCROP1_STRT_MASK        (0x7fff << FLASH_PCROP1SR_PCROP1_STRT_SHIFT)
#    define FLASH_PCROP1SR_PCROP1_STRT(n)        (((n) << FLASH_PCROP1SR_PCROP1_STRT_SHIFT) & FLASH_PCROP1SR_PCROP1_STRT_MASK)
#endif

/* Flash PCROP1 End Address Register (PCROP1ER) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_PCROP1ER_PCROP1_END_SHIFT        (0)
#  define FLASH_PCROP1ER_PCROP1_END_MASK         (0x7fff << FLASH_PCROP1ER_PCROP1_END_SHIFT)
#    define FLASH_PCROP1ER_PCROP1_END(n)         (((n) << FLASH_PCROP1ER_PCROP1_END_SHIFT) & FLASH_PCROP1ER_PCROP1_END_MASK)
#  define FLASH_PCROP1ER_PCROP_RDP               (1 << 31)
#endif

/* Flash Bank 1 WRP Area A Address Register (WRP1AR) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_WRP1AR_WRP1A_STRT_SHIFT          (0)
#  define FLASH_WRP1AR_WRP1A_STRT_MASK           (0x7f << FLASH_WRP1AR_WRP1A_STRT_SHIFT)
#    define FLASH_WRP1AR_WRP1A_STRT(n)           (((n) << FLASH_WRP1AR_WRP1A_STRT_SHIFT) & FLASH_WRP1AR_WRP1A_STRT_MASK)
#  define FLASH_WRP1AR_WRP1A_END_SHIFT           (16)
#  define FLASH_WRP1AR_WRP1A_END_MASK            (0x7f << FLASH_WRP1AR_WRP1A_END_SHIFT)
#    define FLASH_WRP1AR_WRP1A_END(n)            (((n) << FLASH_WRP1AR_WRP1A_END_SHIFT) & FLASH_WRP1AR_WRP1A_END_MASK)
#endif

/* Flash Bank 1 WRP Area B Address Register (WRPB1R) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_WRP1BR_WRP1B_STRT_SHIFT          (0)
#  define FLASH_WRP1BR_WRP1B_STRT_MASK           (0x7f << FLASH_WRP1BR_WRP1B_STRT_SHIFT)
#    define FLASH_WRP1BR_WRP1B_STRT(n)           (((n) << FLASH_WRP1BR_WRP1B_STRT_SHIFT) & FLASH_WRP1BR_WRP1B_STRT_MASK)
#  define FLASH_WRP1BR_WRP1B_END_SHIFT           (16)
#  define FLASH_WRP1BR_WRP1B_END_MASK            (0x7f << FLASH_WRP1BR_WRP1B_END_SHIFT)
#    define FLASH_WRP1BR_WRP1B_END(n)            (((n) << FLASH_WRP1BR_WRP1B_END_SHIFT) & FLASH_WRP1BR_WRP1B_END_MASK)
#endif

/* Flash PCROP2 Start Address Register (PCROP2SR) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_PCROP2SR_PCROP2_STRT_SHIFT       (0)
#  define FLASH_PCROP2SR_PCROP2_STRT_MASK        (0x7fff << FLASH_PCROP2SR_PCROP2_STRT_SHIFT)
#    define FLASH_PCROP2SR_PCROP2_STRT(n)        (((n) << FLASH_PCROP2SR_PCROP2_STRT_SHIFT) & FLASH_PCROP2SR_PCROP2_STRT_MASK)
#endif

/* Flash PCROP2 End Address Register (PCROP2ER) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_PCROP2ER_PCROP2_END_SHIFT        (0)
#  define FLASH_PCROP2ER_PCROP2_END_MASK         (0x7fff << FLASH_PCROP2ER_PCROP2_END_SHIFT)
#    define FLASH_PCROP2ER_PCROP2_END(n)         (((n) << FLASH_PCROP2ER_PCROP2_END_SHIFT) & FLASH_PCROP2ER_PCROP2_END_MASK)
#endif

/* Flash Bank 2 WRP Area A Address Register (WRP2AR) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_WRP2AR_WRP2A_STRT_SHIFT          (0)
#  define FLASH_WRP2AR_WRP2A_STRT_MASK           (0x7f << FLASH_WRP2AR_WRP2A_STRT_SHIFT)
#    define FLASH_WRP2AR_WRP2A_STRT(n)           (((n) << FLASH_WRP2AR_WRP2A_STRT_SHIFT) & FLASH_WRP2AR_WRP2A_STRT_MASK)
#  define FLASH_WRP2AR_WRP2A_END_SHIFT           (16)
#  define FLASH_WRP2AR_WRP2A_END_MASK            (0x7f << FLASH_WRP2AR_WRP2A_END_SHIFT)
#    define FLASH_WRP2AR_WRP2A_END(n)            (((n) << FLASH_WRP2AR_WRP2A_END_SHIFT) & FLASH_WRP2AR_WRP2A_END_MASK)
#endif

/* Flash Bank 2 WRP Area B Address Register (WRP2BR) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_WRP2BR_WRP2B_STRT_SHIFT          (0)
#  define FLASH_WRP2BR_WRP2B_STRT_MASK           (0x7f << FLASH_WRP2BR_WRP2B_STRT_SHIFT)
#    define FLASH_WRP2BR_WRP2B_STRT(n)           (((n) << FLASH_WRP2BR_WRP2B_STRT_SHIFT) & FLASH_WRP2BR_WRP2B_STRT_SHIFT)
#  define FLASH_WRP2BR_WRP2B_END_SHIFT           (16)
#  define FLASH_WRP2BR_WRP2B_END_MASK            (0x7f << FLASH_WRP2BR_WRP2B_END_SHIFT)
#    define FLASH_WRP2BR_WRP2B_END(n)            (((n) << FLASH_WRP2BR_WRP2B_END_SHIFT) & FLASH_WRP2BR_WRP2B_END_MASK)
#endif

/* Flash Securable Area Bank 1 Register (SEC1R) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_SEC1R_SEC_SIZE1_SHIFT            (0)
#  define FLASH_SEC1R_SEC_SIZE1_MASK             (0xff << FLASH_SEC1R_SEC_SIZE1_SHIFT)
#    define FLASH_SEC1R_SEC_SIZE1(n)             (((n) << FLASH_SEC1R_SEC_SIZE1_SHIFT) & FLASH_SEC1R_SEC_SIZE1_MASK)
#  define FLASH_SEC1R_BOOT_LOCK                  (1 << 16)
#endif

/* Flash Securable Area Bank 2 Register (SEC2R) */

#if defined(CONFIG_STM32_STM32G4XXX)
#  define FLASH_SEC2R_SEC_SIZE2_SHIFT            (0)
#  define FLASH_SEC2R_SEC_SIZE2_MASK             (0xff << FLASH_SEC2R_SEC_SIZE2_SHIFT)
#    define FLASH_SEC2R_SEC_SIZE2(n)             (((n) << FLASH_SEC2R_SEC_SIZE2_SHIFT) & FLASH_SEC2R_SEC_SIZE2_MASK)
#endif

/****************************************************************************
 * Public Functions Prototypes
 ****************************************************************************/

int stm32_flash_lock(void);
int stm32_flash_unlock(void);

#if defined(CONFIG_STM32_HAVE_IP_FLASH_M3M4_F2F4)
int stm32_flash_writeprotect(size_t page, bool enabled);
#endif

#endif /* __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_FLASH_V1V2_H */
